app/controllers/burgers_controller.rb

  def index
    @burgers = Burger.all
---
SELECT "burgers".* FROM "burgers"